insert into users
values (1, 'Вася', '123'),
       (2, 'Коля', '321'),
       (3, 'Борис', 'qwerty');


insert into user_contacts
values (3, 'boris@ya.ru', 79003330303),
       (1, 'vasya@mail.ru', null),
       (2, null, 79002220202);

insert into product_type
values (1, 'Молочные продукты'),
       (2, 'Хлеб и выпечка'),
       (3, 'Овощи и фрукты'),
       (4, 'Колбасы'),
       (5, 'Сладости'),
       (6, 'Мясо и птица');

insert into products
values (1,'Молоко', 65.0, 10, 1),
       (2, 'Хлеб', 50.5, 10, 2),
       (3, 'Томаты', 265.0, 10, 3),
       (4, 'Печенье', 120.5, 10, 2),
       (5, 'Колбаса', 1200.5, 10, 4),
       (6, 'Конфеты', 350.0, 10, 5),
       (7, 'Картофель', 35.5, 10, 3),
       (8, 'Говядина', 600.0, 10, 6),
       (9, 'Курица', 250.5, 10, 6);

insert into promotions
values (1,'Скидка 10%', 10),
       (2, 'Скидка 30%', 30),
       (3, 'За 1 рубль', 99);

insert into products_promotions (product_id, promotions_id)
values (1, 1),
       (2, 1),
       (2, 2),
       (3, 1),
       (3, 2),
       (3, 3),
       (4, 2),
       (6, 2),
       (5, 3);